nanoTitan/SprokytFirmware/SprokytFirmware/X-CUBE-SPN6/Drivers/BSP/STM32F3xx-Nucleo/stm32f3xx_nucleo_ihm06a1.c
/**
  ******************************************************************************
  * @file    stm32f3xx_nucleo_ihm06a1.c
  * @author  IPC Rennes
  * @version V1.1.0
  * @date    August 11th, 2016
  * @brief   BSP driver for x-nucleo-ihm06a1 Nucleo extension board 
  *  (based on STSPIN220)
  ******************************************************************************
* @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */ 
  
/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_nucleo_ihm06a1.h"

/** @addtogroup BSP
  * @{
  */ 

/** @defgroup STM32F3XX_NUCLEO_IHM06A1 STM32F3XX NUCLEO IHM06A1
  * @{
  */   
    
/* Private constants ---------------------------------------------------------*/    

/** @defgroup IHM06A1_Private_Constants IHM06A1 Private Constants
  * @{
  */   
    
/// Timer Prescaler for step clocks
#define TIMER_PRESCALER (64)
    
/// MCU wait time after power bridges are enabled
#define BRIDGE_TURN_ON_DELAY                                     (10)

/// RC Filtering delay on the PWM
#define PWM_FILTER_TIME_CONSTANT                                 (5)

/**
  * @}
  */ 

/* Private variables ---------------------------------------------------------*/

/** @defgroup IHM06A1_Board_Private_Variables IHM06A1 Board Private Variables
  * @{
  */
/// Timer handler for step clock
TIM_HandleTypeDef hTimerStepClock;

/// Step clock compare value
volatile uint32_t ccrValue;

/// Timer handler for REF
TIM_HandleTypeDef hTimerPwm;

/**
  * @}
  */ 

/** @defgroup IHM06A1_Board_Private_Function_Prototypes IHM06A1 Board Private Function Prototypes
  * @{
  */   
//Delay of the requested number of milliseconds   
void Stspin220_Board_Delay(uint32_t delay);
//Disable Irq
void Stspin220_Board_DisableIrq(void);
//Enable Irq
void Stspin220_Board_EnableIrq(void);
//Initialise GPIOs used for STSPIN220
void Stspin220_Board_GpioInit(void);
//Start step clock 
void Stspin220_Board_TimStckStart(void);
//Set step clock frequency and start it
void Stspin220_Board_TimStckSetFreq(uint16_t newFreq);
//Sets the frequency and duty cycle of PWM used for the reference voltage 
//generation
void Stspin220_Board_PwmRefSetFreqAndDutyCycle(uint32_t newFreq,uint8_t dutyCycle);
//Init the timer
void Stspin220_Board_TimStckInit(void);
//DeInit the timer
void Stspin220_Board_TimStckDeInit(void);
//Stop the timer
uint8_t Stspin220_Board_TimStckStop(volatile uint8_t *pToggleOdd);
//Init the reference voltage pwm
void Stspin220_Board_PwmRefInit(void);
//Start the reference voltage pwm
void Stspin220_Board_PwmRefStart(void);
//Stop the reference voltage pwm
void Stspin220_Board_PwmRefStop(void);
//Set the STSPIN220 STBY RESET pin and leave low consumption mode
void Stspin220_Board_ReleaseReset(void);
//Reset the STSPIN220 STBY RESET pin and force low consumption mode
void Stspin220_Board_Reset(void);
//Set the state of the direction GPIO
void Stspin220_Board_SetDirectionGpio(uint8_t gpioState);
//Enable the power bridges (leave the output bridges HiZ)
void Stspin220_Board_Enable(void);
//Disable the power bridges (leave the output bridges HiZ)
void Stspin220_Board_Disable(void);
//Get the EN FAULT pin state
uint32_t Stspin220_Board_EN_AND_FAULT_PIN_GetState(void);
//Select the STSPIN220 mode1, mode2, mode3 and mode4 pins levels
uint8_t Stspin220_Board_SetModePins(uint8_t modePin1Level,\
  uint8_t modePin2Level,\
  uint8_t modePin3Level,\
  uint8_t modePin4Level);
//Select Full Step mode
void Stspin220_Board_SetFullStep(void);
//Unselect Full Step mode
void Stspin220_Board_UnsetFullStep(void);
//Step clock compare value initialization
void Stspin220_Board_TimStckCompareInit(void);
/**
  * @}
  */

/** @defgroup IHM06A1_Board_Private_Functions IHM06A1 Board Private Functions
  * @{
  */   

/******************************************************//**
 * @brief This function provides an accurate delay in milliseconds
 * @param[in] delay  time length in milliseconds
 * @retval None
 **********************************************************/
void Stspin220_Board_Delay(uint32_t delay)
{
  HAL_Delay(delay);
}

/******************************************************//**
 * @brief This function disable the interruptions
 * @retval None
 **********************************************************/
void Stspin220_Board_DisableIrq(void)
{
  __disable_irq();
}

/******************************************************//**
 * @brief This function enable the interruptions
 * @retval None
 **********************************************************/
void Stspin220_Board_EnableIrq(void)
{
  __enable_irq();
}

/******************************************************//**
 * @brief  Initiliases the GPIOs used by the STSPIN220
 * @retval None
  **********************************************************/
void Stspin220_Board_GpioInit(void)
{
   GPIO_InitTypeDef GPIO_InitStruct;
   
  /* GPIO Ports Clock Enable */
  __GPIOA_CLK_ENABLE();
  __GPIOB_CLK_ENABLE();
  __GPIOC_CLK_ENABLE();  

  /* Configure STSPIN220 - EN pin --------------------------------------------*/
  /* When this pin is set low, it is configured just before as                */
  /* GPIO_MODE_OUTPUT_PP with GPIO_NOPULL                                     */
  /* When this pin is set high, it is just after configured for FAULT         */
  /* as GPIO_MODE_IT_FALLING with GPIO_PULLUP                                 */
  Stspin220_Board_Disable();
  
